#include <bitset>
#include <iostream>
#include <cmath>
#include <stdexcept>
#include <string>

// Функція для обчислення S відповідно до формули варіанту 25
double s_calculation(double x, double y, double z) {
    return fabs(sqrt(fabs(z - 2 * x)) - x * sin(pow(x, 2 * z) * y));
}



 std::string task_9_1(double s_v){

    if (s_v < 0.3)
        return "Бал Босфорта: 0. Відсутність вітру. Дим піднімається прямовисто. Листя дерев нерухомі.";
    else if (s_v > 0.3 && s_v <= 1.5)
        return "Бал Босфорта: 1. Дим 'пливе'. Флюгер не обертається.";
    else if (s_v > 1.5 && s_v <= 3.4)
        return "Бал Босфорта: 2. Рух повітря відчувається обличчям. Шелестить листя. Флюгери обертаються.";
    else if (s_v > 3.4 && s_v <= 5.4)
        return "Бал Босфорта: 3. Тріпоче листя, хитаються дрібні гілки. Майорять прапори.";
    else if (s_v > 5.4 && s_v <= 7.9)
        return "Бал Босфорта: 4. Хитаються тонкі гілки дерев. Вітер піднімає пил та шматки паперу.";
    else if (s_v > 7.9 && s_v <= 10.7)
        return "Бал Босфорта: 5. Хитаються великі гілки. На воді з'являються хвилі.";
    else if (s_v > 10.7 && s_v <= 13.8)
        return "Бал Босфорта: 6. Хитаються великі гілки.";
    else if (s_v > 13.8 && s_v <= 17.1)
        return "Бал Босфорта: 7. Хитаються невеликі стовбури дерев. На морі здіймаються хвилі, піняться.";
    else if (s_v > 17.1 && s_v <= 20.7)
        return "Бал Босфорта: 8. Ламаються гілки дерев. Важко йти проти вітру.";
    else if (s_v > 20.7 && s_v <= 24.4)
        return "Бал Босфорта: 9. Невелике руйнування. Зриває покрівлі, руйнує димарі.";
    else if (s_v > 24.4 && s_v <= 28.4)
        return "Бал Босфорта: 10. Значні руйнування. Дерева вириваються з корінням.";
    else if (s_v > 28.4 && s_v <= 32.6)
        return "Бал Босфорта: 11. Великі руйнування.";
    else if (s_v > 32.6)
        return "Бал Босфорта: 12. Призводить до спустошень.";
}


double celsiusToFahrenheit(double celsius) {
    return (celsius * 9.0 / 5.0) + 32;
}

int countBits(int N) {
    std::bitset<16> bin(N);
    bool D7 = bin[7];
    return D7 ? bin.count() : (16 - bin.count());
}
